IDENTIFICATION DIVISION.
PROGRAM-ID. ADIVINA-SEMILLA.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMERO-SECRETO  PIC 9(2).
01 SEMILLA-USUARIO PIC 9(8).
01 NUMERO-CANDIDATO PIC 9(2).
01 SEMILLA-BASE    PIC 9(8).

PROCEDURE DIVISION.
    
    ACCEPT SEMILLA-BASE FROM TIME.
    COMPUTE NUMERO-SECRETO = FUNCTION MOD(FUNCTION RANDOM(SEMILLA-BASE) * 100, 100).
    
    DISPLAY "--- JUEGO: ADIVINA EL NUMERO SECRETO ---"
    DISPLAY "He generado un numero secreto (00-99)."

    PERFORM UNTIL NUMERO-CANDIDATO = NUMERO-SECRETO
        DISPLAY "Introduce una semilla para generar tu intento: " WITH NO ADVANCING
        ACCEPT SEMILLA-USUARIO
        
        
        COMPUTE NUMERO-CANDIDATO = FUNCTION MOD(FUNCTION RANDOM(SEMILLA-USUARIO) * 100, 100)
        
        DISPLAY "Tu semilla " SEMILLA-USUARIO " generó el numero: " NUMERO-CANDIDATO
        
        IF NUMERO-CANDIDATO < NUMERO-SECRETO
            DISPLAY "Muy bajo..."
        ELSE IF NUMERO-CANDIDATO > NUMERO-SECRETO
            DISPLAY "Muy alto..."
        END-IF
    END-PERFORM.

    DISPLAY "¡Felicidades! Has domado el azar."
    STOP RUN.
