IDENTIFICATION DIVISION.
PROGRAM-ID. ADIVINA-ALEATORIO.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ARCHIVO-RESULTADOS ASSIGN TO "resultados.txt"
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD ARCHIVO-RESULTADOS.
01 REGISTRO-BD.
    05 NOMBRE-REG    PIC A(20).
    05 NUMERO-REG    PIC 9(2).
    05 INTENTOS-REG  PIC 9(3).

WORKING-STORAGE SECTION.
01 NUMERO-SECRETO    PIC 9(2).
01 SEMILLA           PIC 9(9).
01 INTENTO           PIC 9(2) VALUE 99.
01 NOMBRE-JUGADOR    PIC A(20).
01 CONTADOR-INTENTOS PIC 9(3) VALUE 0.

PROCEDURE DIVISION.
    *> Generar numero aleatorio
    ACCEPT SEMILLA FROM TIME.
    COMPUTE NUMERO-SECRETO = FUNCTION MOD(FUNCTION RANDOM(SEMILLA) * 100, 100).
    
    DISPLAY "Cual es tu nombre? " WITH NO ADVANCING
    ACCEPT NOMBRE-JUGADOR
    DISPLAY "He pensado un numero del 00 al 99."
    
    *> Bucle de juego
    PERFORM UNTIL INTENTO = NUMERO-SECRETO
        ADD 1 TO CONTADOR-INTENTOS
        DISPLAY "Tu intento: " WITH NO ADVANCING
        ACCEPT INTENTO
        
        IF INTENTO < NUMERO-SECRETO
            DISPLAY "Muy bajo."
        ELSE IF INTENTO > NUMERO-SECRETO
            DISPLAY "Muy alto."
        END-IF
    END-PERFORM.

    DISPLAY "¡Correcto, " NOMBRE-JUGADOR "! Ganaste en " CONTADOR-INTENTOS " intentos."

    *> Guardar en archivo (Simulando la base de datos)
    OPEN OUTPUT ARCHIVO-RESULTADOS
    MOVE NOMBRE-JUGADOR TO NOMBRE-REG
    MOVE NUMERO-SECRETO  TO NUMERO-REG
    MOVE CONTADOR-INTENTOS TO INTENTOS-REG
    WRITE REGISTRO-BD
    CLOSE ARCHIVO-RESULTADOS

    DISPLAY "Resultado guardado en resultados.txt".
    STOP RUN.