IDENTIFICATION DIVISION.
PROGRAM-ID. ADIVINA-ALEATORIO.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMERO-SECRETO PIC 9(2).
01 SEMILLA        PIC 9(9).
01 INTENTO        PIC 9(2).
01 NOMBRE-JUGADOR PIC A(20).

PROCEDURE DIVISION.
    
    ACCEPT SEMILLA FROM TIME.
    COMPUTE NUMERO-SECRETO = FUNCTION MOD(FUNCTION RANDOM(SEMILLA) * 100, 100).
    DISPLAY "cual es tu nombre? " WITH NO ADVANCING
    ACCEPT NOMBRE-JUGADOR
    DISPLAY "He pensado un numero del 00 al 99.".
    
    PERFORM UNTIL INTENTO = NUMERO-SECRETO
        DISPLAY "Tu intento: " WITH NO ADVANCING
        ACCEPT INTENTO
        
        IF INTENTO < NUMERO-SECRETO
            DISPLAY "Muy bajo."
        ELSE IF INTENTO > NUMERO-SECRETO
            DISPLAY "Muy alto."
        END-IF
    END-PERFORM.

    DISPLAY "¡Correcto! Has ganado.".
    STOP RUN.
